import React, { useState } from "react";
import "./Questions.modules.css";

const CommonQuestion = () => {
  const [openIndex, setOpenIndex] = useState(null);

  const toggleItem = (index) => {
    setOpenIndex(openIndex === index ? null : index);
  };

  const data = [
    {
      q: "كيف يتم تسجيل شقة تمليك في الشهر العقاري؟",
      a: "لتسجيل شقة تمليك، يجب تقديم عقد البيع النهائي الموثق، وشهادة التصرفات العقارية التي تثبت ملكية البائع، ودفع الرسوم القانونية. يتم تقديم الطلب إلى الشهر العقاري بعد فحص العقار والتأكد من صحة المستندات، وإذا تم قبول الطلب، يتم التسجيل الرسمي في السجل العقاري.",
    },
    {
      q: "ما هي الشروط القانونية لرفع دعوى خلع؟",
      a: "تتطلب دعوى الخلع تنازل الزوجة عن حقوقها المالية، مثل مؤخر الصداق والنفقة، وكذلك إرجاع مقدم الصداق للزوج. يجب على الزوجة تقديم طلب رسمي للمحكمة مع توضيح أسباب استحالة استمرار الحياة الزوجية، ولا يشترط موافقة الزوج على الخلع. تقيم المحكمة الدعوى بناءً على الشهادات والمستندات المقدمة.",
    },
    {
      q: "ما هي عقوبات النصب الإلكتروني في القانون المصري؟",
      a: "يُعاقب مرتكب جريمة النصب الإلكتروني بالحبس مدة لا تقل عن سنة وبغرامة تتراوح بين 50 ألف و100 ألف جنيه، أو بإحدى هاتين العقوبتين. في الحالات الخطيرة، قد تصل العقوبة إلى السجن المشدد.",
    },
    {
      q: "كيف يمكن استرداد الشبكة والهدايا بعد فسخ الخطوبة؟",
      a: "في القانون المصري، يُعتبر الخاطب له الحق في استرداد الشبكة والهدايا بعد فسخ الخطوبة. يتعين رفع دعوى أمام المحكمة لإستردادها، ويجب على الخاطب إثبات أن فسخ الخطوبة كان لأسباب خارجة عن إرادته.",
    },
    {
      q: "كيف يتم تسجيل شقة تمليك في الشهر العقاري؟",
      a: "لتسجيل شقة تمليك، يجب تقديم عقد البيع النهائي الموثق، وشهادة التصرفات العقارية التي تثبت ملكية البائع، ودفع الرسوم القانونية. يتم تقديم الطلب إلى الشهر العقاري بعد فحص العقار والتأكد من صحة المستندات، وإذا تم قبول الطلب، يتم التسجيل الرسمي في السجل العقاري.",
    },
    {
      q: "ما هي الشروط القانونية لرفع دعوى خلع؟",
      a: "تتطلب دعوى الخلع تنازل الزوجة عن حقوقها المالية، مثل مؤخر الصداق والنفقة، وكذلك إرجاع مقدم الصداق للزوج. يجب على الزوجة تقديم طلب رسمي للمحكمة مع توضيح أسباب استحالة استمرار الحياة الزوجية، ولا يشترط موافقة الزوج على الخلع. تقيم المحكمة الدعوى بناءً على الشهادات والمستندات المقدمة.",
    },
    {
      q: "ما هي عقوبات النصب الإلكتروني في القانون المصري؟",
      a: "يُعاقب مرتكب جريمة النصب الإلكتروني بالحبس مدة لا تقل عن سنة وبغرامة تتراوح بين 50 ألف و100 ألف جنيه، أو بإحدى هاتين العقوبتين. في الحالات الخطيرة، قد تصل العقوبة إلى السجن المشدد.",
    },
    {
      q: "كيف يمكن استرداد الشبكة والهدايا بعد فسخ الخطوبة؟",
      a: "في القانون المصري، يُعتبر الخاطب له الحق في استرداد الشبكة والهدايا بعد فسخ الخطوبة. يتعين رفع دعوى أمام المحكمة لإستردادها، ويجب على الخاطب إثبات أن فسخ الخطوبة كان لأسباب خارجة عن إرادته.",
    },
  ];

  return (
    <>
    <div className="row">
            {data.map((item, index) => (
              <div key={index}>
                <div className="col-12">
                <div className="item py-3" onClick={() => toggleItem(index)}>
                  <div className="content d-flex justify-content-between align-items-center">
                    <h5 className="mb-0">{item.q}</h5>

                    <span
                      className={`arrow ${openIndex === index ? "open" : ""}`}
                    >
                      ⌄
                    </span>
                  </div>
                </div>
                {openIndex === index && (
                  <div className="answer-box">
                    <p className="answer">{item.a}</p>
                  </div>
                )}
              </div>
              </div>
            ))}
            </div>
            </>
  );
};

export default CommonQuestion;
