import { memo } from 'react';
import MainTitle from '../MainTitle/MainTitle';
import './Services.modules.css';

const Services = ({title}) => {
  return (
    <>
      <div className="services py-5" id="services">
        <div className="container">
          <MainTitle title="خدماتنا" />
          <div className="row">
            <div className="col-xl-6 .col-12 mt-4">
              <h3>الخدمات القانونية:</h3>
              <h5>
                وهذه الخدمات تشمل القطاعات القانونية المختلفة من خلال نخبة من
                المتخصصين كل في مجاله وهم مجموعة الشركاء بمؤسسة المحامي المحترف،
                وهذه القطاعات تشمل ما يلي:
              </h5>
              <ul>
                <li>قسم العقود.</li>
                <li>قسم التحكيم.</li>
                <li>قسم القانون الجنائي.</li>
                <li>قسم القانون التجاري.</li>
                <li>قسم القانون العقاري.</li>
                <li>قسم القانون العمل.</li>
                <li>قسم قانون الأسرة.</li>
                <li>قسم القانون البحري والجوي.</li>
                <li>قسم القانون الإداري.</li>
                <li>قسم الأعمال الإدارية والتراخيص العامة.</li>
                <li>
                  قسم التسجيل التجاري والعلامات التجارية والملكية الفكرية.
                </li>
                <li>قسم التدريب القانوني.</li>
                <li>القسم المحاسبي.</li>
                <li>قسم النشر المكتبي والاليكتروني.</li>
              </ul>
            </div>
            <div className="col-xl-6 col-12 d-flex justify-content-center">
              <img src="/services_main.webp" alt="" />
            </div>
          </div>
          <div className="button text-center">
            <button className="btn">اقرأ المزيد</button>
          </div>
          <div className="row">
            <div className="col-12 mb-3">
              <h3 id="join-legal-training">الالتحاق بمركز التدريب القانوني:</h3>
              <h5>
                وهذا المركز هو عبارة عن معهد تعليمي منشأ خصيصاً بالمؤسسة لتدريب
                المحامين الجدد وطلبة كليات الحقوق أثناء العطلات الدراسية
                لإعدادهم إعداداً قانونياً على مستوى عالٍ يمكنهم من الحصول على
                فرص عمل مناسبة طبقاً لمهاراتهم المختلفة. وهذا المركز يقوم على
                إدارته نخبة متميزة من أساتذة القانون والمحامين المتخصصين، هدفهم
                إعداد جيل جديد من المحامين على مستوى مهني وعلمي متميز يمكنهم من
                المضي قدماً في حياتهم العملية على مستوى يؤهلهم لأن يكونوا
                بالكيفية التي ينبغي أن يكون عليها المحامون في مصر مادياً
                ومعنوياً. كما يوفر المركز للدارسين به فرص التوظيف المناسبة
                بمكاتب المحاماة والمؤسسات القانونية المختلفة، طبقاً لما تسفر عنه
                الاختبارات الشفوية والتحريرية للدارسين من حيث الكفاءة العلمية
                والعملية.
              </h5>
            </div>
            <div className="col-12 mb-3">
              <h3 id="legal-publications">الإصدارات القانونية والإلكترونية:</h3>
              <h5>
                إعداد الدراسات والأبحاث القانونية والمحاسبية والضريبية المختلفة
                ونشرها بالوسائل المختلفة لتمكين الغير من مكاتب وشركات المحاماة
                والمكاتب والشركات المحاسبية المتخصصة والكيانات الاقتصادية
                المختلفة والأفراد من الاستفادة بالعلم، وكذلك البرامج الإلكترونية
                المتنوعة التي تساعد المتخصصين في مجال عملهم.
              </h5>
            </div>
            <div className="col-12 mb-3">
              <h3 id="find-employee">ابحث عن موظف:</h3>
              <h5>
                وهذه الخدمة يقدمها الموقع للسادة أصحاب الأعمال المختلفة داخل مصر
                أو خارجها الباحثين عن عمالة مدربة أو غير مدربة في جميع التخصصات
                وتوفيرها لهم واستقبال السير الذاتية للموظفين عبر الموقع وتقديم
                أفضل مواصفات لأصحاب الأعمال. كما يقدم الموقع خدمة أخرى لأصحاب
                الأعمال تتمثل في إبرام عقود العمل بين الموظف وصاحب العمل
                وإمكانية استقبال أصحاب الأعمال من الخارج لإجراء مقابلاتهم
                بالمؤسسة لاختيار العمالة المناسبة والقيام بدور الوكيل القانوني
                لأصحاب الأعمال من الخارج في هذا الشأن وذلك طبقاً للشروط
                والأحكام.
              </h5>
            </div>
          </div>
        </div>
      </div>
    </>
  );
};

export default memo(Services);