import { memo } from 'react';
import MainTitle from '../MainTitle/MainTitle';
import '../Services/Services.modules.css';

const Departments = () => {
  return (
    <>
      <div className="departments py-5" id='our-services'>
        <div className="container">
          <MainTitle title="خدماتنا" align="right" />
          <div className="mb-5">
            <h3>قسم القانون المدني:</h3>
            <h5>
              يشمل قسم القانون المدني الدفاع في القضايا المدنية، رفع الدعاوى،
              والتعامل مع المنازعات المدنية المختلفة مثل دعاوى الملكية، العقود،
              التعويضات، الإخلاء، وتنفيذ الأحكام.
            </h5>
            <h5>
              كما يتضمن كتابة الطعون أمام محكمة النقض وتمثيل العملاء أمام
              المحكمة.
            </h5>
          </div>
          <div className="mb-5">
            <h3>قسم العقود:</h3>
            <h5>
              يختص هذا القسم بإعداد ومراجعة وكتابة العقود بجميع أنواعها، بما في
              ذلك عقود الشقق، الأراضي، الفيلات، العقارات، البيع بالتقسيط، عقود
              الإيجار، عقود الرهن للسفن، العقود التجارية، والاتفاقيات القانونية
              الأخرى.
            </h5>
          </div>
          <div className="mb-5">
            <h3>قسم التحكيم:</h3>
            <h5>
              يتعامل هذا القسم مع قضايا التحكيم المحلية والدولية، حيث يمثل
              العملاء كمحكمين أو مدافعين. كما يتخصص في تأسيس والإشراف على
              الأقسام القانونية للكيانات الاقتصادية.
            </h5>
          </div>
          <div className="mb-5">
            <h3>قسم القانون المدني:</h3>
            <h5>
              يتمثل دور قسم القانون الجنائي في الدفاع عن العملاء في مختلف
              القضايا الجنائية، بما في ذلك الجرائم الكبيرة مثل تهريب المخدرات،
              القتل، الاعتداء، الرشوة، الاحتيال، وغيرها من الجرائم الخطيرة.
            </h5>
            <h5>
              كما يتعامل مع القضايا أمام المحاكم العسكرية وقضايا تحصيل الديون.
            </h5>
          </div>
          <div className="mb-5">
            <h3>قسم القانون التجاري والضريبي:</h3>
            <h5>
              يتعامل هذا القسم مع المنازعات التجارية، قضايا الإفلاس، إعادة
              الهيكلة المالية، تأسيس الشركات، المنازعات الضريبية، ويوفر حلولًا
              للشركات التي تواجه صعوبات مالية.
            </h5>
          </div>
          <div className="mb-5">
            <h3>قسم قانون العقارات والسياحة:</h3>
            <h5>
              يتخصص هذا القسم في معاملات العقارات، تسجيل الملكية، الحصول على
              تصاريح الهدم والبناء، وتسهيل الاستثمار في قطاع العقارات. كما
              يتعامل مع تسجيل المنشآت السياحية وإدارة الاستثمارات العقارية.
            </h5>
          </div>
          <div className="mb-5">
            <h3>قسم قانون العمل:</h3>
            <h5>
              يمثل هذا القسم العملاء في المنازعات العمالية، ويتعامل مع عقود
              العمل، الرواتب، المزايا، اتفاقيات الإنهاء، وقضايا التأمينات
              الاجتماعية وحقوق العمال.
            </h5>
          </div>
          <div className="mb-5">
            <h3>قسم قانون الأسرة:</h3>
            <h5>
              يركز هذا القسم على قضايا قانون الأسرة مثل الطلاق، النفقة، الحضانة،
              الميراث، والنزاعات المتعلقة بالبنوة. كما يسهل تسوية المنازعات
              الأسرية.
            </h5>
          </div>
          <div className="mb-5">
            <h3>قسم قانون الملاحة والطيران:</h3>
            <h5>
              يتعامل هذا القسم مع المنازعات المتعلقة بقانون الملاحة والطيران،
              مثل تسجيل السفن والطائرات، الحوادث، دعاوى التعويضات، والتمثيل
              القانوني في المنازعات البحرية والجوية.
            </h5>
          </div>
          <div className="mb-5">
            <h3>قسم القانون الإداري:</h3>
            <h5>
              يدافع هذا القسم عن العملاء في القضايا أمام المحاكم الإدارية، بما
              في ذلك النزاعات المتعلقة بالجنسية، الطعون الإدارية، والتحديات ضد
              القرارات الحكومية.
            </h5>
          </div>
          <div className="mb-5">
            <h3>قسم الشؤون الإدارية والتراخيص العامة:</h3>
            <h5>
              يساعد هذا القسم في الحصول على وتجديد التراخيص للمنشآت، تصاريح
              الإقامة للأجانب، والتمثيل القانوني لمكاتب الهجرة.
            </h5>
            <h5>
              كما يدير التفاعل مع الجهات الحكومية مثل أقسام المرور، الدفاع
              المدني، والبلديات.
            </h5>
          </div>
          <div className="mb-5">
            <h3>
              قسم التسجيل التجاري والعلامات التجارية وحماية الملكية الفكرية:
            </h3>
            <h5>
              يتعامل هذا القسم مع تسجيل العلامات التجارية محليًا ودوليًا، تسجيل
              براءات الاختراع، وحماية الملكية الفكرية.
            </h5>
            <h5>
              كما يراقب ويعالج الانتهاكات المتعلقة بالملكية الفكرية ويتخذ
              الإجراءات القانونية ضد المنتهكين.
            </h5>
          </div>
          <div className="mb-5">
            <h3>قسم التدريب القانوني:</h3>
            <h5>
              يوفر هذا القسم تدريبًا للمحامين الجدد لتعزيز مهاراتهم القانونية،
              بما في ذلك التقاضي، إعداد العقود، والبحث القانوني.
            </h5>
            <h5>
              كما يقدم برامج متخصصة في الظهور أمام المحاكم، إعداد الوثائق
              القانونية بالعربية والإنجليزية، وإعداد المذكرات القانونية والطعون.
            </h5>
          </div>
          <div className="mb-5">
            <h3>قسم النشر (الطباعة والإلكتروني):</h3>
            <h5>
              ينشر هذا القسم الأبحاث والدراسات القانونية والمالية والضريبية،
              ويوفر خدمات الطباعة والنشر الإلكتروني للمكاتب القانونية، مكاتب
              المحاسبة، والكيانات الاقتصادية لتحسين وصولهم إلى المعرفة
              القانونية.
            </h5>
          </div>
        </div>
      </div>
    </>
  );
};

export default memo(Departments);






