import { memo } from "react";
import "./AboutRoutes.modules.css";
import MainTitle from "../MainTitle/MainTitle";
import "../Services/Services.modules.css";

const Tasks = () => {
  return (
    <>
      <div className="tasks py-5">
        <div className="container">
          <div className="mb-4" id="mission">
            <MainTitle title="مهمتنا" align="right" />
            <h5>
              يعمل جميع أفراد المؤسسة يد واحدة من أجل تقديم أفضل خدمة لعملائنا
              في المجال القانوني وذلك من خلال الأقسام المختلفة للمؤسسة والتي
              يباشرها أفضل المحامين والمستشارين المتخصصين كل في مجاله لتقديم
              أفضل خدمة بتكلفة تتناسب مع هذه الخدمات المقدمة سواء على مستوى
              المجال القانوني.
            </h5>
          </div>
          <div className="mb-4" id="vision">
            <MainTitle title="رؤياتنا" align="right" />
            <h5>
              أن العمل المؤسسي هو أفضل تنظيم يمكن أن يفيد منه العملاء حيث انتهى
              عصر العمل الفردي ليجد العميل نفسه وخاصة أصحاب الكيانات الاقتصادية
              سواء الكبيرة أو الصغيرة محاطاً بخط دفاع متكامل على المستوى
              القانوني لتأمين وحماية مصالحه وأمواله واستثماراته , فيجد العميل
              متنوع من الخدمات التي تؤدى له بصرف النظر عن حجم أعماله .
            </h5>
            <h5>
              كما أننا وضعنا أنظمة مختلفة للتعامل المالي بشأن الخدمات التي تقدم
              للعميل من المؤسسة نظير الخدمات الاستشارية أو التطبيقية في كلا
              المجالين بحيث يتم تقييمها بحسب حجم الخدمات التي يرغب العميل فيها
              وبحسب المجال الذي يرغب في التعامل فيه سواء القانوني أو الاقتصادي
              أو كليهما وهذه الأنظمة تشمل الاستحقاق السنوي أو كل حالة بحالتها.
            </h5>
          </div>
          <div className="mb-4" id="future-aspirations">
            <MainTitle title="تطلعاتنا المستقبلية" align="right" />
            <h5>
              بالنظر إلي طبيعة مسئوليتنا وخطورة مهمتنا تجاه عملاؤنا لما يتعلق
              بالمساس بمصالحهم الشخصية والاقتصادية على السواء فإننا نسعى إلى أن
              تكون مؤسسة المحامي المحترف من ضمن المؤسسات القانونية التي لها نسبة
              استحواذ عالية للكيانات الاقتصادية في مصر والوطن العربي وأن نضم
              العديد والعديد من الكيانات الاقتصادية إلي أسطول عملاؤنا لنكون شريك
              رئيسي لعملائنا في نجاحاتهم المستمرة بفضل الجهود المبذولة من فريق
              عمل يسعى في مهمة رئيسية هي تأمين مصالح عملاؤه على المستوي القانوني
              للدفع بهم إلي التقدم المستمر في خطوات ثابتة لا بديل عنها نحو
              النجاح.
            </h5>
          </div>
        </div>
      </div>
    </>
  );
};

export default memo(Tasks);
